       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAINPROG.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-IN-NUMBER     PIC 9(4) VALUE 5.
       01  WS-OUT-NUMBER    PIC 9(4).

       PROCEDURE DIVISION.
           CALL "SUBPROG" USING WS-IN-NUMBER WS-OUT-NUMBER
           DISPLAY "Output is: " WS-OUT-NUMBER
           STOP RUN.
