       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBPROG.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01  IN-NUMBER    PIC 9(4).
       01  OUT-NUMBER   PIC 9(4).

       PROCEDURE DIVISION USING IN-NUMBER OUT-NUMBER.
           COMPUTE OUT-NUMBER = IN-NUMBER * 2
           GOBACK.
           