           identification division.
           program-id. RenteBerekening.

           data division.
           working-storage section.
           
           